-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Dec 14, 2021 at 11:38 PM
-- Server version: 10.5.12-MariaDB-cll-lve
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `u784869084_tele_truth_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `data`
--

CREATE TABLE `data` (
  `id` int(11) NOT NULL,
  `col` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `val` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `data`
--

INSERT INTO `data` (`id`, `col`, `val`) VALUES
(0, 'current_turn', NULL),
(1, 'game_started', '0');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `question` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `used` varchar(1) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `question`, `used`) VALUES
(1, '• ما أسوأ شيء فعلته في الحياة؟', '0'),
(2, ' • ما أغرب شيء تناولته؟', '0'),
(3, ' • ما آخر قرار أخذته وندمت عليه؟', '0'),
(4, ' • ما أكثر شيء تكرهه في نفسك؟', '0'),
(5, ' • هل ظلمت أحد من قبل؟ كيف؟', '0'),
(6, ' • كيف ولماذا تركك الحبيب؟', '0'),
(7, ' • هل أحببت من طرف واحد من قبل؟', '0'),
(8, ' • هل غدر بك أعز صديق لك؟ كيف؟', '0'),
(9, ' • إذا خيرتِ بين الزواج والعمل أي منهما ستختارين؟', '0'),
(10, ' • هل يمكنكِ الخروج دون وضع مكياج؟', '0'),
(11, ' • ما هو الشيء الذي يمثل لك خط أحمر؟', '0'),
(12, ' • ما هي الأفكار الجنونية التي تراودك؟', '0'),
(13, ' • من أول حب في حياتك؟ وما هي نهاية هذه القصة؟', '0'),
(14, ' • من أقرب شخص لك في هذه الغرفة؟', '0'),
(15, ' • هل من الممكن أن تعرضي على شخص تحبينه الزواج؟', '0'),
(16, ' • هل من الممكن أن توافقي على السفر إلى الخارج مع الزوج للعيش بشكل نهائي؟', '0'),
(17, ' • كم عدد تجاربك العاطفية؟', '0'),
(18, ' • هل يتواجد شخصًا تحبه في هذه الغرفة؟', '0'),
(19, ' • أوصف حياتك في كلمة؟', '0'),
(20, ' • هل لا تستطيع النوم بسبب شخص أو ذكريات؟', '0'),
(21, ' • هل حاولت الانتحار من قبل؟ لماذا؟', '0'),
(22, ' • ما الشيء الذي تخاف منه؟', '0'),
(23, ' • هل يتواجد شخص تود أن تراه يبكي أمامك؟ من؟', '0'),
(24, ' • هل ظللت سنوات تحب شخص تركك؟', '0'),
(25, ' • ما أقوى صدمة عاطفية أثرت فيك؟', '0'),
(26, 'اسئلة صراحة قوية', '0'),
(27, ' • هل هُناك موقف كلما تذكرته تبكي بشدة؟', '0'),
(28, ' • هل ساعدت أحد من قبل، وبعد ذلك شعرت بالندم لأنه لا يستحق؟', '0'),
(29, ' • حددي لنا درجة حبك لنفسك من 1 إلى 10؟', '0'),
(30, ' • هل هُناك عادة تفعلها ترغب في التوقف عنها؟', '0'),
(31, ' • من أول شخص يخطر على بالك عند الوقوع في مشكلة أو ضيق؟', '0'),
(32, ' • أوصف نفسك في كلمة؟', '0'),
(33, ' • هل من الممكن أن تقبلين أن تكونين زوجة ثانية؟', '0'),
(34, ' • إذا جاءت لك فرصة للهجرة دون رجعة هل ستفعل هذا؟ لماذا؟', '0'),
(35, ' • ماذا ستفعلين إذا منعتِ من وضع المكياج طوال حياتكِ؟', '0'),
(36, ' • هل شعرت أن قلبك يؤلمك حقًا بسبب أحدهم؟', '0'),
(37, ' • إذا لم يكن هُناك قانون أو حلال وحرام، ما الأشياء التي سترغب في فعلها؟', '0'),
(38, ' • ما الموقف الذي شعرت أنك لن تتجاوزه بسهولة؟', '0'),
(39, ' • ما السبب في بكائك آخر مرة؟', '0'),
(40, ' • من وجهة نظرك لماذا يحب الإنسان من باعه، ويتمسك به بشدة؟', '0'),
(41, ' • هل أنت راض عن نفسك؟ لماذا؟', '0'),
(42, ' • إذا كانت هُناك إمكانية للرجوع إلى الماضي وتغيير شيء ما، ماذا سيكون؟', '0'),
(43, ' • هل ترى نفسك محظوظًا ؟ لماذا؟', '0'),
(44, 'اسئلة صراحة صعبة', '0'),
(45, ' • ما أكثر صفة تكرهها في؟', '0'),
(46, ' • لو قلت لك حدد حبك ليا من 1 إلى 10، كم ستعطيني؟', '0'),
(47, ' • هل أظهرت ضعفك أمام أحدهم من قبل؟', '0'),
(48, ' • إذا خُيرت بين الحبيب والصديق من ستختار؟', '0'),
(49, ' • هل لكِ صديقة تغارين منها؟', '0'),
(50, ' • هل خذلت أحدًا من قبل؟', '0'),
(51, ' • ما الذكريات التي تود أن تنساها نهائيًا؟', '0'),
(52, ' • إذا كانت أمامك فرصة لمحو جميع الذكريات السيئة هل ستفعل؟', '0'),
(53, ' • كيف تنظر للمستقبل ؟', '0'),
(54, ' • هل تحب شخصًا، ولكنك تخشى مصارحته؟ ولماذا؟', '0'),
(55, ' • هل فكرت في الانتحار من قبل؟ لماذا؟', '0'),
(56, ' • هل من الممكن أن تعترفي لأحدهم بحبك؟', '0'),
(57, ' • هل هُناك شخص تود الانتقام منه؟ ولماذا؟', '0'),
(58, ' • ما أكثر شيء يؤلمك في الحال؟', '0'),
(59, ' • هل تشعرين أن هُناك صديقة تغيير منكِ؟', '0'),
(60, ' • هل من الممكن أن تتزوج امرأة كان يحبها أخوك؟', '0'),
(61, ' • هل هُناك لحظة تمنيت أن يتوقف عندها الزمن؟ ما هي؟', '0'),
(62, '• لماذا يشعرن البنات بالحزن ويبكين بحرقة عند مشاهدة الدراما بالرغم من أنها مجرد تمثيل وهن يعلمن ذلك؟', '0'),
(63, ' • لماذا قد يعاني الأولاد من الاكتئاب بسبب خسارة فريقهم المفضل في أحد المباريات؟', '0'),
(64, ' • لماذا يشعرن الفتيات بالغضب والحزن لعدم وجود زي مناسب على الرغم من وجود العديد من الملابس في خزانتهن؟', '0'),
(65, ' • لماذا تكره الذهاب إلى التسوق إلى هذه الدرجة؟ ألا يمكنك تقبل الأمر على الإطلاق؟', '0'),
(66, ' • لماذا تأخذين كل ذلك الوقت لتجهيز نفسك قبل الخروج من المنزل؟', '0'),
(67, ' • هل تستطيع الاهتمام بوزنك وتحديد الطعام الذي تقوم بتناوله؟ وهل حقًا أقرب طريق إلى قلب الرجل هو معدته؟', '0'),
(68, ' • كم عدد تجاربك العاطفية؟', '0'),
(69, ' • ما هو رأيك الحقيقي في الحب؟', '0'),
(70, ' • من هو الشخص الذي تحلمين به كل ليلة؟', '0'),
(71, ' • من هو الشخص الذي لا تستطيع أن ترفض له طلب؟', '0'),
(72, '• هل تستطيعين عدم وضع مكياج إلى الأبد؟', '0'),
(73, ' • هل فكرتي في إجراء عملية تجميل؟', '0'),
(74, ' • هل أنتي راضية عن شكلك حاليًا؟', '0'),
(75, ' • هل تساعدين والدتك في الأعمال المنزلية؟', '0'),
(76, ' • كم من صديقاتك تغارين منها؟', '0'),
(77, ' • هل تتمنين أن تصيري أمًا؟', '0'),
(78, ' • هل تحبين شكلك عند الاستيقاظ من النوم؟', '0'),
(79, ' • كم ساعة تنامين في اليوم؟', '0'),
(80, ' • كم مرة أحببتي في حياتك؟', '0'),
(81, ' • كم تصرفين في الشهر؟', '0'),
(82, ' • كم ميزانيتك الشهرية للملابس؟', '0'),
(83, ' • ما هو سبب بكائك آخر مرة؟', '0'),
(84, ' • هل تستطيعي السفر مع زوجك للعيش خارج بلدك؟', '0'),
(85, ' • هل أنتي راضيك عن وزنك؟', '0'),
(86, ' • هل توافي على سفر زوجك للعمل في الخارج بدونك؟', '0'),
(87, ' • هل يوجد شخص تعرفيه وتتنمي الزواج منه؟', '0'),
(88, ' • إذا أحببتي شخص هل تستطيعي جذبه إليكي؟', '0'),
(89, ' • هل تقبلين أن تكوني زوجة ثانية لرجل تحبييه؟', '0'),
(90, ' • هل تؤمنين بان الحب شيء مهم في حياتك؟', '0'),
(91, ' • هل تقبلي الزواج من رجل لا يغار كثيرًا؟', '0'),
(92, ' • هل أخبرتي شخص بمشاعر إعجاب أو حب من قبل أن يخبرك؟', '0'),
(93, ' • ما هو أكثر ما تحبينه في الرجل؟', '0'),
(94, ' • ما هو الموقف الذي يجعلك في تناقض وحيرة؟', '0'),
(95, ' • أيهما أفضلك لك: الزواج عن حب أم الزواج التقليدي؟', '0'),
(96, ' • هل يمكنك التنازل عن المستوى المادي في مقابل الحب؟', '0'),
(97, ' • هل تعيشين قصة حب في الوقت الحالي؟', '0'),
(98, ' • إذا خيرك حبيبك بينه وبين صديقة عمرك فمن تختاري؟', '0'),
(99, ' • هل انتقمتي سابقًا من شخص ما؟ كيف كان هذا الانتقام؟ هل شعرتي بالندم على ذلك؟', '0'),
(100, ' • هل يمكن أن تكرهي شخص كنتي تحبيه؟ أو تحبي شخص كنتي تكرهيه؟', '0'),
(101, ' • هل تملكين شخص يمكنه تغيير حالتك النفسية بكلمة واحدة؟', '0'),
(102, ' • هل يمكنكي التخلي عن هدفك من أجل شخص؟', '0'),
(103, ' • هل تملكين شخص تثقي بأنه يمكنه التخلي عن هدفه من أجلك؟', '0'),
(104, ' • هل لديك سر تخفيه عن جميع الناس بشكل تام؟', '0'),
(105, ' • متى كانت المرة الأخيرة التي كذبتي فيها؟', '0'),
(106, ' • من هو الشخص الذي تهربي منه؟', '0'),
(107, ' • من هو الشخص الذي تبوحي له بكل أسرارك؟', '0'),
(108, ' • من هو الشخص الذي تُفكري به دائمًا؟', '0'),
(109, ' • هل تملكين صديقة مثل الأخت؟ أو أخت مثل الصديقة؟ وهل هي محل أسرارك؟', '0'),
(110, ' • هل تشعرين بالخوف من القطط؟ وما رد فعلك إذا اعترضت طريقك قطة؟', '0'),
(111, ' • هل يمكن أن تخافي خوفًا هيستيريًا من الحشرات؟', '0'),
(112, ' • ما هو عمرك الحقيقي؟', '0'),
(113, ' • ما هي العادة التي تفضلي أن تبتعدي عنها؟', '0'),
(114, ' • من هو الشخص الذي تودي أن تنتقمي منه أشد انتقام؟', '0'),
(115, ' • ما الشيء الذي يُلفت انتباهك؟', '0'),
(116, ' • هل حياتك سعيدة أم حزينة؟', '0'),
(117, ' • هل بكيتي من قبل أمام الشخص الذي تحبيه؟', '0'),
(118, ' • هل تعرضتي في حياتك إلى صدمة عاطفية؟', '0'),
(119, '• ما هي الحكمة التي تقوم بتطبيقها في حياتك؟', '0'),
(120, ' • ماذا لو خيروك ما بين الذهاب إلى المستقبل أو الرجوع إلى الماضي؟', '0'),
(121, ' • ما هو أصعب موقف قد تعرضت له في حياتك؟', '0'),
(122, ' • هل تعرضت قبل ذلك لغدر في حياتك؟', '0'),
(123, ' • ما هو التاريخ الذي لا يمكن أن تنساه أبدًا؟', '0'),
(124, ' • هل تشعر بالرضا عن ذاتك؟', '0'),
(125, ' • إذا كان هناك اختيار أن تُعيد تسمية نفسك فهل تقبل بإسمك أم ستقوم بتغييره؟', '0'),
(126, '• ما هو الحلم البعيد الذي لا تستطيع تحقيقه؟', '0'),
(127, ' • من هو الشخص الذي تحلم به في كل ليلة؟', '0'),
(128, ' • هل تعلقت بشخص لدرجة كنت لا تتخيلها؟', '0'),
(129, ' • هل تعرضت قبل ذلك للجاثوم (شلل النوم) في حلمك؟', '0'),
(130, ' • لو أغمضت عينيك الآن فما هو أول شيء سوف تفكر به؟', '0'),
(131, ' • هل تنظر للمستقبل بطريقة إيجابية أم بطريقة سلبية؟', '0'),
(132, ' • هل يمكن أن تنسى أمر مزعج بسهولة؟', '0'),
(133, '• من هو الصديق الذي دائمًا ما يتم الاعتماد عليه في الأمور المختلفة؟', '0'),
(134, ' • من هو الصديق الذي يمكنه مساعدة الجميع وتخفيف الحزن عنهم؟', '0'),
(135, ' • هل لديكم صديق يتقن الغناء؟', '0'),
(136, ' • متى كانت أول مرة اجتمعتم فيها؟ وأين كان ذلك؟ وما المناسبة؟', '0'),
(137, ' • من هو أخر شخص انضم إلى المجموعة؟', '0'),
(138, ' • إذا كنت تشعر بالغضب فكيف ستتصرف؟', '0'),
(139, ' • هل تحب أن يكون لزوجك/ لزوجتك صديق/ صديقة؟', '0'),
(140, ' • هل تستطيع العيش بدون أصدقاء؟', '0'),
(141, ' • هل تعرضت للخيانة في أحد الأيام؟', '0'),
(142, ' • هل وفقت بين شخصين متخاصمين؟', '0'),
(143, '• إذا دخلت مُسابقة وربحت 5 مليون دولار ماذا تفعل بهم؟', '0'),
(144, ' • إذا ندمت على فعل شيءٍ ما، ماذا يكون ذلك الشيء؟', '0'),
(145, ' • إذا قالوا لك افعل جريمة ما، فما الجريمة التي ستختارها؟', '0'),
(146, ' • إذا أعجبت بشخصٍ ما، كيف تُظهر له ذلك الإعجاب؟', '0'),
(147, ' • إذا وجدت ورقة بيضاء فماذا ترسم بها لتعبر عن حالتك النفسية؟', '0'),
(148, ' • إذا قمت بالسفر لنزهة خارج بلدك فمن هو الشخص الذي تريد أن يرافقك في سفرك؟', '0'),
(149, ' • إذا تركك حبيبك، هل ستعود إليه مرة ثانية أم تتركه وتنتظر عودته؟', '0'),
(150, ' • إذا طلب منك شريك حياتك الانفصال، فماذا يكون ردك؟', '0'),
(151, ' • إذا كان والدك يعمل بعملٍ فقير هل تقبل به أم تستعر منه؟', '0'),
(152, ' • إذا وجدت حبيبك في يومٍ ما يمسك بطفله، هل ستشعر بالألم؟', '0'),
(153, ' • إذا علمت أن صديقك يحب أختك ماذا تفعل؟', '0'),
(154, ' • إذا قمت بتصنيف نفسك هل تختار أنك شخص سلبي أم إيجابي؟', '0'),
(155, ' • إذا أحببت صديقتك، فهل يمكنك اخبارها عن هذا الحب؟', '0'),
(156, ' • إذا ذهبت إلى مكتبة بها العديد من الكتب، ما هي الكُتب التي ستختارها؟', '0'),
(157, ' • إذا أصبحت رئيسًا للجمهورية فما أول قرار ستتخذه لتصلح حال البلاد؟', '0'),
(158, ' • إذا تم اختيارك لتصبح من وزراء بلدك، فما هي الوزارة التي تفضل أن تكون رئيسًا لها؟', '0'),
(159, '• ما هي أكبر مخاوفك؟', '0'),
(160, ' • ما هو التصرف الذي قمت به وسبب مشاكل؟', '0'),
(161, ' • من هو أقرب شخص لك من بين الأشخاص الموجودين؟', '0'),
(162, ' • من هو الشخص الذي لا تحبه من بين الأشخاص الموجودين؟', '0'),
(163, ' • ما هو السر الذي تخفيه عن جميع الأشخاص المقربين لك؟', '0'),
(164, ' • هل تؤمن بقدرتك على النجاح وتحدي المستحيل؟ أم أنك تشعر بأن ما تبذله هو أقصى ما تقدر عليه؟', '0'),
(165, ' • هل يمكنك أن تكذب كذبة بيضاء؟ وفي حالة إذا كان جوابك “نعم” هل تهتم بما يخص لغة الجسد لكي لا يتم كشف كذبتك؟', '0'),
(166, ' • ماذا لو كذب أحد الأشخاص عليك لأجلك هل يمكنك مسامحته؟ وما هو أول رد فعل سوف يصدر عنك عندما تعرف الحقيقة؟', '0'),
(167, ' • هل تشعر بالخوف من سر ما تقوم بإخفائه يمكن أن يسبب كارثة إذا قد تم كشفه؟', '0'),
(168, '• هل تُعاني من مشكلة التفكير قبل النوم؟', '0'),
(169, ' • هل أنت شخص مُسامح أم لا تستطيع أن تُسامح؟', '0'),
(170, ' • هل تستطيع أن تُتقن عملك أم تشعر بالممل؟', '0'),
(171, ' • هل أنت شخص عُدواني؟', '0'),
(172, ' • هل ترى نفسك شخصًا مُتناقضًا؟', '0'),
(173, ' • هل أنت شخص اجتماعي أم شخص مُنطوي؟', '0'),
(174, ' • هل قمت بالتنازل عن مبدأك في الحياة؟', '0'),
(175, ' • هل انتحلت أحد الشخصيات لكي تكذب على من حولك؟', '0'),
(176, ' • هل تفتخر بوالديك؟', '0'),
(177, '• هل والدتك هي المثل الأعلى لك أم هناك شخص آخر؟', '0'),
(178, ' • هل قلت كلام معين تتمنى عدم قوله؟', '0'),
(179, ' • هل تحب كل أخواتك بنفس المقدار أم تستثنى أحدهم بقلبك؟', '0'),
(180, ' • هل تشعر بحب التملك؟', '0'),
(181, ' • هل الملابس تعطي انطباعات مختلفة عن الأشخاص؟', '0'),
(182, ' • هل أنت شخص منافق أم شخص صريح؟', '0'),
(183, ' • هل قمت بتناول أحد أنواع المخدرات أو المواد الكحولية من قبل؟', '0'),
(184, ' • هل ضحكت قبل ذلك وأنت في عزاء للمُتوفي؟', '0'),
(185, ' • هل تُؤمن بضرب الأطفال للتربية؟', '0'),
(186, ' • هل تعرضت للظلم قبل ذلك؟', '0');

-- --------------------------------------------------------

--
-- Table structure for table `turns`
--

CREATE TABLE `turns` (
  `id` int(11) NOT NULL,
  `turn_userID` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(25) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `userID` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `fName` varchar(25) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lName` varchar(25) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `data`
--
ALTER TABLE `data`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `turns`
--
ALTER TABLE `turns`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
